MarkWendler/sound_generator_dsPIC_X2C/mcc_generated_files/adc1.h
inline static void ADC1_SoftwareTriggerEnable(void)
{
   ADCON3Lbits.SWCTRG = 1;
}

/**
  @Summary
    Disables software common trigger.

  @Description
    This routine is used to disable the ADC1 software common trigger.
 
  @Preconditions
    ADC1_Initialize function should have been called 
    before calling this function.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
*/
inline static void ADC1_SoftwareTriggerDisable(void)
{
   ADCON3Lbits.SWCTRG = 0;
}

/**
  @Summary
    Allows selection of a channel for conversion.

  @Description
    This routine is used to select desired channel for conversion.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.

  @Param
    channel - Channel for conversion

  @Returns
    None
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
*/
inline static void ADC1_ChannelSelect( ADC1_CHANNEL channel )
{
    /*This routine does not have any implementation since 
            *Shared channels are selected from UI.
            *Dedicated channels are selected from UI.
    */
}

/**
  @Summary
    Returns the conversion value for the channel selected.

  @Description
    This routine is used to get the analog to digital converted value for a 
    specific channel.
 
  @Preconditions
    This routine returns the conversion value only after the conversion is complete. 
    Conversion completion status can be checked using ADC1_IsConversionComplete(channel)
    routine.

  @Param
    channel - Selected channel
   
  @Returns
   Returns the analog to digital converted value
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
 */
inline static uint16_t ADC1_ConversionResultGet( ADC1_CHANNEL channel )
{
    uint16_t result;

    switch(channel)
    {
        case CH_AN2_TEMPEXT:
                result = ADCBUF2;
                break;
        case CH_AN4_IBUS:
                result = ADCBUF4;
                break;
        case CH_AN11_POT:
                result = ADCBUF11;
                break;
        case CH_AN12_TEMPLOCAL:
                result = ADCBUF12;
                break;
        case CH_AN15_VBUS:
                result = ADCBUF15;
                break;
        case CH_AN17_VA:
                result = ADCBUF17;
                break;
        case CH_AN22_VC:
                result = ADCBUF22;
                break;
        case CH_AN23_VB:
                result = ADCBUF23;
                break;
        case CH_AN0_IA:
                result = ADCBUF0;
                break;
        default:
                break;
    }
    return result;
}

/**
  @Summary
    Returns the status of conversion.

  @Description
    This routine is used to determine if conversion is completed. When conversion
    is complete the routine returns true otherwise false.
 
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.

  @Param
    channel - Selected channel
 
  @Returns
    true - Conversion is complete.
    false - Conversion is not complete.
  
  @Example
    <code>
        int conversion,i=0;
        ADC1_Initialize();

        ADC1_Enable();
        ADC1_ChannelSelect(channel);
        ADC1_SoftwareTriggerEnable();
        //Provide Delay
        for(i=0;i <1000;i++)
        {
        }
        ADC1_SoftwareTriggerDisable();
        while(!ADC1_IsConversionComplete(channel));
        conversion = ADC1_ConversionResultGet(channel);
        ADC1_Disable(); 
    </code>
 */
inline static bool ADC1_IsConversionComplete(ADC1_CHANNEL channel)
{
    bool status;

    switch(channel)
    {
        case CH_AN2_TEMPEXT:
                status = ADSTATLbits.AN2RDY;
                break;
        case CH_AN4_IBUS:
                status = ADSTATLbits.AN4RDY;
                break;
        case CH_AN11_POT:
                status = ADSTATLbits.AN11RDY;
                break;
        case CH_AN12_TEMPLOCAL:
                status = ADSTATLbits.AN12RDY;
                break;
        case CH_AN15_VBUS:
                status = ADSTATLbits.AN15RDY;
                break;
        case CH_AN17_VA:
                status = ADSTATHbits.AN17RDY;
                break;
        case CH_AN22_VC:
                status = ADSTATHbits.AN22RDY;
                break;
        case CH_AN23_VB:
                status = ADSTATHbits.AN23RDY;
                break;
        case CH_AN0_IA:
                status = ADSTATLbits.AN0RDY;
                break;
        default:
                break;
    }

    return status;
}

/**
  @Summary
    Enables interrupts.

  @Description
    This routine is used to enable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptEnable(); 
    </code>
*/
inline static void ADC1_InterruptEnable(void)
{
    IEC5bits.ADCIE = 1;
}

/**
  @Summary
    Disables interrupts.

  @Description
    This routine is used to disable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptDisable(); 
    </code>
*/
inline static void ADC1_InterruptDisable(void)
{
    IEC5bits.ADCIE = 0;
}

/**
  @Summary
    Clears interrupt flag

  @Description
    This routine is used to clear the interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptFlagClear(); 
    </code>
*/
inline static void ADC1_InterruptFlagClear(void)
{
    IFS5bits.ADCIF = 0;
}

/**
  @Summary
    Allows selection of priority for interrupt.

  @Description
    This routine is used to select desired priority for interrupt.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        uint16_t priorityValue;
        priorityValue = 0x002;
 
        ADC1_InterruptPrioritySet(priorityValue); 
    </code>
*/
inline static void ADC1_InterruptPrioritySet( uint16_t priorityValue )
{
    IPC22bits.ADCIP = 0x7 & priorityValue;
}

/**
  @Summary
    ADC1 Common callback routine.

  @Description
    This routine is a ADC1 Common callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_CallBack(void);

/**
  @Summary
    Assigns a function pointer with a ADC1 Common callback address.

  @Description
    This routine assigns a function pointer with a ADC1 Common callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_SetCommonInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_Tasks();
    </code>
*/
void ADC1_Tasks(void);

/**
  @Summary
    Enables individual channel interrupt.

  @Description
    This routine is used to enable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptEnable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptEnable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case CH_AN2_TEMPEXT:
                IEC5bits.ADCAN2IE = 1;
                break;
        case CH_AN4_IBUS:
                IEC5bits.ADCAN4IE = 1;
                break;
        case CH_AN11_POT:
                IEC6bits.ADCAN11IE = 1;
                break;
        case CH_AN12_TEMPLOCAL:
                IEC6bits.ADCAN12IE = 1;
                break;
        case CH_AN15_VBUS:
                IEC6bits.ADCAN15IE = 1;
                break;
        case CH_AN17_VA:
                IEC6bits.ADCAN17IE = 1;
                break;
        case CH_AN22_VC:
                IEC7bits.ADCAN22IE = 1;
                break;
        case CH_AN23_VB:
                IEC7bits.ADCAN23IE = 1;
                break;
        case CH_AN0_IA:
                IEC5bits.ADCAN0IE = 1;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Disables individual channel interrupt.

  @Description
    This routine is used to disable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptDisable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptDisable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case CH_AN2_TEMPEXT:
                IEC5bits.ADCAN2IE = 0;
                break;
        case CH_AN4_IBUS:
                IEC5bits.ADCAN4IE = 0;
                break;
        case CH_AN11_POT:
                IEC6bits.ADCAN11IE = 0;
                break;
        case CH_AN12_TEMPLOCAL:
                IEC6bits.ADCAN12IE = 0;
                break;
        case CH_AN15_VBUS:
                IEC6bits.ADCAN15IE = 0;
                break;
        case CH_AN17_VA:
                IEC6bits.ADCAN17IE = 0;
                break;
        case CH_AN22_VC:
                IEC7bits.ADCAN22IE = 0;
                break;
        case CH_AN23_VB:
                IEC7bits.ADCAN23IE = 0;
                break;
        case CH_AN0_IA:
                IEC5bits.ADCAN0IE = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Clears individual channel interrupt flag

  @Description
    This routine is used to clear the individual channel interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptFlagClear(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptFlagClear(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case CH_AN2_TEMPEXT:
                IFS5bits.ADCAN2IF = 0;
                break;
        case CH_AN4_IBUS:
                IFS5bits.ADCAN4IF = 0;
                break;
        case CH_AN11_POT:
                IFS6bits.ADCAN11IF = 0;
                break;
        case CH_AN12_TEMPLOCAL:
                IFS6bits.ADCAN12IF = 0;
                break;
        case CH_AN15_VBUS:
                IFS6bits.ADCAN15IF = 0;
                break;
        case CH_AN17_VA:
                IFS6bits.ADCAN17IF = 0;
                break;
        case CH_AN22_VC:
                IFS7bits.ADCAN22IF = 0;
                break;
        case CH_AN23_VB:
                IFS7bits.ADCAN23IF = 0;
                break;
        case CH_AN0_IA:
                IFS5bits.ADCAN0IF = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    ADC1 CH_AN2_TEMPEXT callback routine.

  @Description
    This routine is a ADC1 CH_AN2_TEMPEXT callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN2_TEMPEXTInterruptHandler(&ADC1_CH_AN2_TEMPEXT_CallBack);
    </code>
*/
void ADC1_CH_AN2_TEMPEXT_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN2_TEMPEXT callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN2_TEMPEXT callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN2_TEMPEXTInterruptHandler(&ADC1_CH_AN2_TEMPEXT_CallBack);
    </code>
*/
void ADC1_SetCH_AN2_TEMPEXTInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 CH_AN2_TEMPEXT polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_CH_AN2_TEMPEXT_Tasks();
    </code>
*/
void ADC1_CH_AN2_TEMPEXT_Tasks(void);

/**
  @Summary
    ADC1 CH_AN4_IBUS callback routine.

  @Description
    This routine is a ADC1 CH_AN4_IBUS callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN4_IBUSInterruptHandler(&ADC1_CH_AN4_IBUS_CallBack);
    </code>
*/
void ADC1_CH_AN4_IBUS_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN4_IBUS callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN4_IBUS callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN4_IBUSInterruptHandler(&ADC1_CH_AN4_IBUS_CallBack);
    </code>
*/
void ADC1_SetCH_AN4_IBUSInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 CH_AN4_IBUS polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_CH_AN4_IBUS_Tasks();
    </code>
*/
void ADC1_CH_AN4_IBUS_Tasks(void);

/**
  @Summary
    ADC1 CH_AN11_POT callback routine.

  @Description
    This routine is a ADC1 CH_AN11_POT callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN11_POTInterruptHandler(&ADC1_CH_AN11_POT_CallBack);
    </code>
*/
void ADC1_CH_AN11_POT_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN11_POT callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN11_POT callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN11_POTInterruptHandler(&ADC1_CH_AN11_POT_CallBack);
    </code>
*/
void ADC1_SetCH_AN11_POTInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 CH_AN11_POT polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_CH_AN11_POT_Tasks();
    </code>
*/
void ADC1_CH_AN11_POT_Tasks(void);

/**
  @Summary
    ADC1 CH_AN12_TEMPLOCAL callback routine.

  @Description
    This routine is a ADC1 CH_AN12_TEMPLOCAL callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN12_TEMPLOCALInterruptHandler(&ADC1_CH_AN12_TEMPLOCAL_CallBack);
    </code>
*/
void ADC1_CH_AN12_TEMPLOCAL_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN12_TEMPLOCAL callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN12_TEMPLOCAL callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN12_TEMPLOCALInterruptHandler(&ADC1_CH_AN12_TEMPLOCAL_CallBack);
    </code>
*/
void ADC1_SetCH_AN12_TEMPLOCALInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 CH_AN12_TEMPLOCAL polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_CH_AN12_TEMPLOCAL_Tasks();
    </code>
*/
void ADC1_CH_AN12_TEMPLOCAL_Tasks(void);

/**
  @Summary
    ADC1 CH_AN15_VBUS callback routine.

  @Description
    This routine is a ADC1 CH_AN15_VBUS callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN15_VBUSInterruptHandler(&ADC1_CH_AN15_VBUS_CallBack);
    </code>
*/
void ADC1_CH_AN15_VBUS_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN15_VBUS callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN15_VBUS callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN15_VBUSInterruptHandler(&ADC1_CH_AN15_VBUS_CallBack);
    </code>
*/
void ADC1_SetCH_AN15_VBUSInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 CH_AN15_VBUS polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_CH_AN15_VBUS_Tasks();
    </code>
*/
void ADC1_CH_AN15_VBUS_Tasks(void);

/**
  @Summary
    ADC1 CH_AN17_VA callback routine.

  @Description
    This routine is a ADC1 CH_AN17_VA callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN17_VAInterruptHandler(&ADC1_CH_AN17_VA_CallBack);
    </code>
*/
void ADC1_CH_AN17_VA_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN17_VA callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN17_VA callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN17_VAInterruptHandler(&ADC1_CH_AN17_VA_CallBack);
    </code>
*/
void ADC1_SetCH_AN17_VAInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 CH_AN17_VA polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_CH_AN17_VA_Tasks();
    </code>
*/
void ADC1_CH_AN17_VA_Tasks(void);

/**
  @Summary
    ADC1 CH_AN22_VC callback routine.

  @Description
    This routine is a ADC1 CH_AN22_VC callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN22_VCInterruptHandler(&ADC1_CH_AN22_VC_CallBack);
    </code>
*/
void ADC1_CH_AN22_VC_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN22_VC callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN22_VC callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN22_VCInterruptHandler(&ADC1_CH_AN22_VC_CallBack);
    </code>
*/
void ADC1_SetCH_AN22_VCInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 CH_AN22_VC polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_CH_AN22_VC_Tasks();
    </code>
*/
void ADC1_CH_AN22_VC_Tasks(void);

/**
  @Summary
    ADC1 CH_AN23_VB callback routine.

  @Description
    This routine is a ADC1 CH_AN23_VB callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN23_VBInterruptHandler(&ADC1_CH_AN23_VB_CallBack);
    </code>
*/
void ADC1_CH_AN23_VB_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN23_VB callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN23_VB callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN23_VBInterruptHandler(&ADC1_CH_AN23_VB_CallBack);
    </code>
*/
void ADC1_SetCH_AN23_VBInterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 CH_AN23_VB polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_CH_AN23_VB_Tasks();
    </code>
*/
void ADC1_CH_AN23_VB_Tasks(void);


/**
  @Summary
    ADC1 CH_AN0_IA callback routine.

  @Description
    This routine is a ADC1 CH_AN0_IA callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN0_IAInterruptHandler(&ADC1_CH_AN0_IA_CallBack);
    </code>
*/
void ADC1_CH_AN0_IA_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 CH_AN0_IA callback address.

  @Description
    This routine assigns a function pointer with a ADC1 CH_AN0_IA callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCH_AN0_IAInterruptHandler(&ADC1_CH_AN0_IA_CallBack);
    </code>
*/
void ADC1_SetCH_AN0_IAInterruptHandler(void* handler);



/**
  Section: Interface Routines: Dedicated Core
*/
/**
  @Summary
    Enables power for Core 0 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 0.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_Core0PowerEnable(void);

/**
  @Summary
    Enables power for Core 1 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 1.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_Core1PowerEnable(void);


/**
  @Summary
    Enables power for ADC1 shared Core

  @Description
    This routine is used to set the analog and digital power for ADC1 shared Core.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_SharedCorePowerEnable(void);



